In [1]:
! pip install sqlalchemy
! pip install PyMySQL

Requirement already satisfied: sqlalchemy in c:\users\allab\anaconda3\lib\site-packages (1.4.32)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\allab\anaconda3\lib\site-packages (from sqlalchemy) (1.1.1)
Requirement already satisfied: PyMySQL in c:\users\allab\anaconda3\lib\site-packages (1.0.2)

In [2]:
import pymysql
from sqlalchemy import create_engine
import numpy as np
import pandas as pd
import getpass  # to get the password without showing the input
password = getpass.getpass()

········

In [3]:
# Create a Python connection with SQL database and retrieve the results of the last two queries as dataframes.

In [4]:
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)

data_may = pd.read_sql_query('select distinct customer_id, count(rental_id) as num_rentals_may from rentals_may group by customer_id', engine)
data_may.head()

   customer_id  num_rentals_may
0          130                1
1          459                1
2          549                1
3          269                3
4          239                2

In [5]:
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)

data_june = pd.read_sql_query('select distinct customer_id, count(rental_id) as num_rentals_june from rentals_june group by customer_id;', engine)
data_june.head()

   customer_id  num_rentals_june
0          416                 5
1          516                 6
2          239                 5
3          285                 3
4          310                 6

In [6]:
# Write a function that checks if customer borrowed more or less films in the month of June as compared to May.

In [7]:
data = data_may.merge(data_june, on = 'customer_id', how = 'outer')
data.head()

   customer_id  num_rentals_may  num_rentals_june
0          130              1.0               6.0
1          459              1.0               7.0
2          549              1.0               1.0
3          269              3.0               3.0
4          239              2.0               5.0

In [8]:
# Since the exercise statement is ambigous, 2 posibilities: 
# 1) Check if all customers, as a whole, rented more films in May, or rented more films in June
# 2) check if each customer rented more films in May in comparisson to June, and viceversa

In [9]:
# 1) Check if all customers, as a whole, rented more films in May, or rented more films in June

def count_rentals_1(data): 
    if data['num_rentals_may'].sum() > data['num_rentals_june'].sum():
        print('Customers rented more films in May.')
    else:
        print('Customers rented more films in June.')

count_rentals_1(data)

Customers rented more films in June.

In [10]:
# 2) check if each customer rented more films in May in comparisson to June, and viceversa

def count_rentals_2(data): 
    data['mayVSjune'] = np.where(data['num_rentals_may'] > data['num_rentals_june'], 'Rented more in May', 'Rented more in June')
    return data

count_rentals_2 (data)

     customer_id  num_rentals_may  num_rentals_june            mayVSjune
0            130              1.0               6.0  Rented more in June
1            459              1.0               7.0  Rented more in June
2            549              1.0               1.0  Rented more in June
3            269              3.0               3.0  Rented more in June
4            239              2.0               5.0  Rented more in June
..           ...              ...               ...                  ...
588          555              NaN               1.0  Rented more in June
589          425              NaN               1.0  Rented more in June
590          335              NaN               1.0  Rented more in June
591          226              NaN               2.0  Rented more in June
592           22              NaN               1.0  Rented more in June

[593 rows x 4 columns]